ХМНПФ_Общее/Documents/ХМ_МенеджерЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХМ_МенеджерЗагрузки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагружатьИзмененияСДаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачалоПрошлойЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользоватьДопУсловие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеПерезагружатьНайденные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТолькоЗапросы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбновитьЗагрузку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИДКаспер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредставлениеТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаКаспер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаКлиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаСервер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаНеСвязанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЗагрузкиКаспер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХМ_ЗагрузкаКаспер_ТипЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЗагрузкиКлиент</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХМ_ЗагрузкаКаспер_ТипЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЗагрузкиСервер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХМ_ЗагрузкаКаспер_ТипЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтрокаТаблицыСервер_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТабличноеПолеВидыОбъектов_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛогОшибок_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПараметрыЗагрузки_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПравилаЗагрузкиКаспер_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПравилаЗагрузкиКлиент_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПравилаЗагрузкиСервер_ХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Enums/ХМ_ЗагрузкаКаспер_ТипЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХМ_ЗагрузкаКаспер_ТипЗагрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаПоПравиламОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаПоЗапросу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗагрузкаСКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПропуститьЗагрузку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцедурнаяЗагрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УниверсальнаяЗагрузкаВРегистр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/ХМ_МенеджерЗагрузки/Ext/ObjectModule.bsl
&Вместо("ВыполнитьЗагрузку")
Функция ХМВыполнитьЗагрузку(Режим = Неопределено, ДополнительныеПараметры = Неопределено)
	
	ЛогОшибок = Новый Массив;

	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура();
	КонецЕсли;
	
	ТабличноеПолеВидыОбъектов = ТабличноеПолеВидыОбъектов_ХЗ.Получить();

	СтрокаТаблицы = СтрокаТаблицыСервер_ХЗ.Получить();
	
	Если ПроверитьУстановитьТипыЗагрузок(СтрокаТаблицы, ЛогОшибок) = Ложь Тогда
		ЛогОшибок_ХЗ = Новый ХранилищеЗначения(ЛогОшибок);
		Результат = Ложь;
		Возврат Результат;
	КонецЕсли;;

	ПараметрыЗагрузки = ПараметрыЗагрузки_ХЗ.Получить();
	Если ПараметрыЗагрузки = Неопределено Тогда
		ПараметрыЗагрузки = ПолучитьПараметрыЗагрузки(СтрокаТаблицы);
	КонецЕсли;	

	ДополнитьПараметрыЗагрузки(ПараметрыЗагрузки,Режим);

	ПравилаЗагрузкиКаспер = ПравилаЗагрузкиКаспер_ХЗ.Получить();
	Если ПравилаЗагрузкиКаспер = Неопределено Тогда
		ПравилаЗагрузкиКаспер = ПолучитьПравилаЗагрузкиКаспер(СтрокаТаблицы, ДополнительныеПараметры);
	КонецЕсли;	
	ПравилаЗагрузкиКлиент = ПравилаЗагрузкиКлиент_ХЗ.Получить();
	Если ПравилаЗагрузкиКлиент = Неопределено Тогда
		ПравилаЗагрузкиКлиент = ПолучитьПравилаЗагрузкиКлиент(СтрокаТаблицы, ТабличноеПолеВидыОбъектов, ДополнительныеПараметры, ПараметрыЗагрузки);
	КонецЕсли;	
	ПравилаЗагрузкиСервер = ПравилаЗагрузкиСервер_ХЗ.Получить();

	Если Режим = Неопределено ИЛИ Режим = "ЗагрузкаКаспер" ИЛИ Режим = "ЗагрузкаКасперСервер" Тогда
		Начало = ПолучитьТекущееВремя();
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ТолькоЗапросы") Тогда
		ПараметрыЗагрузки.Вставить("ТолькоЗапросы",ДополнительныеПараметры.ТолькоЗапросы);
	КонецЕсли;

	РезультатЗагрузки = ХМ_ЗагрузкаТЗ_Клиент.ЗагрузитьДокумент(СтрокаТаблицы, ПараметрыЗагрузки, ПравилаЗагрузкиКаспер, ПравилаЗагрузкиКлиент, ПравилаЗагрузкиСервер, ДополнительныеПараметры, ЛогОшибок);
	                                                                              
	ЛогОшибок_ХЗ = Новый ХранилищеЗначения(ЛогОшибок);
    ЗаполнитьЗначенияСвойств(ЭтотОбъект,РезультатЗагрузки,"Результат,ЗагрузкаКаспер,ЗагрузкаКлиент,ЗагрузкаСервер");

	Возврат РезультатЗагрузки.Результат;                
КонецФункции

Функция ПроверитьУстановитьТипыЗагрузок(СтрокаТаблицы, ЛогОшибок)
	
	Перем РезультатПроверки;
	
	РезультатПроверки = Истина;
	Если Не ЗначениеЗаполнено(ТипЗагрузкиКаспер) Тогда
		ТипЗагрузкиКаспер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоПравиламОбмена;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТипЗагрузкиКлиент) Тогда
		ТипЗагрузкиКлиент = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоПравиламОбмена;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТипЗагрузкиСервер) Тогда
		ТипЗагрузкиСервер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоПравиламОбмена;
	КонецЕсли;
	Если СтрокаТаблицы.Свойство("ТипЗагрузкиКаспер") И НЕ СтрокаТаблицы.ТипЗагрузкиКаспер = ТипЗагрузкиКаспер Тогда
		ЛогОшибок.Добавить("Не соответствие типов загрузки");
		РезультатПроверки = Ложь;
	Иначе
		СтрокаТаблицы.Вставить("ТипЗагрузкиКаспер",ТипЗагрузкиКаспер);
	КонецЕсли;	
	Если СтрокаТаблицы.Свойство("ТипЗагрузкиКлиент") И НЕ СтрокаТаблицы.ТипЗагрузкиКлиент = ТипЗагрузкиКлиент Тогда
		ЛогОшибок.Добавить("Не соответствие типов загрузки");
		РезультатПроверки = Ложь;
	Иначе
		СтрокаТаблицы.Вставить("ТипЗагрузкиКлиент",ТипЗагрузкиКлиент);
	КонецЕсли;	
	Если СтрокаТаблицы.Свойство("ТипЗагрузкиСервер") И НЕ СтрокаТаблицы.ТипЗагрузкиСервер = ТипЗагрузкиСервер Тогда
		ЛогОшибок.Добавить("Не соответствие типов загрузки");
		РезультатПроверки = Ложь;
	Иначе
		СтрокаТаблицы.Вставить("ТипЗагрузкиСервер",ТипЗагрузкиСервер);
	КонецЕсли;

	Возврат РезультатПроверки;
	
КонецФункции

#Область ИнициализацияЗагрузки


Функция ПолучитьПараметрыЗагрузки(СтрокаТаблицы)
	
	Перем ПараметрыЗагрузки;
	
	ПараметрыЗагрузки = Новый Структура();                

	Если СтрокаТаблицы.ТипЗагрузкиКаспер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоПравиламОбмена Тогда
		ПараметрыЗагрузки.Вставить("ИспользоватьДопУсловие",ИспользоватьДопУсловие);
		ПараметрыЗагрузки.Вставить("ЗагружатьИзмененияСДаты",ЗагружатьИзмененияСДаты);
		ПараметрыЗагрузки.Вставить("ТолькоЗапросы",ТолькоЗапросы);
		ПараметрыЗагрузки.Вставить("ОбновитьЗагрузку",ОбновитьЗагрузку);
		ПараметрыЗагрузки.Вставить("НаСервере",НаСервере);
	КонецЕсли;
	Если СтрокаТаблицы.ТипЗагрузкиКлиент = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоПравиламОбмена Тогда
	КонецЕсли;
	Если СтрокаТаблицы.ТипЗагрузкиСервер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоПравиламОбмена Тогда
		ПараметрыЗагрузки.Вставить("НеПерезагружатьНайденные",НеПерезагружатьНайденные);
		ПараметрыЗагрузки.Вставить("ЗагрузкаНеСвязанных",ЗагрузкаНеСвязанных);
	КонецЕсли;
	
	Возврат ПараметрыЗагрузки;

КонецФункции

Процедура ДополнитьПараметрыЗагрузки(ПараметрыЗагрузки, Режим)

	ПараметрыЗагрузки.Вставить("Режим",Режим);	

	Если Не ПараметрыЗагрузки.Свойство("ДатаИзменений") Тогда
		ПараметрыЗагрузки.Вставить("ДатаИзменений",ДатаИзменений);
	КонецЕсли;	
	Если Не ПараметрыЗагрузки.Свойство("НачалоПрошлойЗагрузки") Тогда
		ПараметрыЗагрузки.Вставить("НачалоПрошлойЗагрузки",НачалоПрошлойЗагрузки);
	КонецЕсли;	
	Если Не ПараметрыЗагрузки.Свойство("ИДКаспер") Тогда
		ПараметрыЗагрузки.Вставить("ИДКаспер",ИДКаспер);
	КонецЕсли;	

	КаталогТаблицы = ?(ЗначениеЗаполнено(ПредставлениеТаблицы),ПредставлениеТаблицы,ИмяТаблицы)+СокрЛП(ИДКаспер);
	СтрокИБ = СтрокаСоединенияИнформационнойБазы();
	Если СтрНайти(СтрокИБ,"Srvr=""192.168.0.247"";") > 0 Тогда
		ИБ = СтрЗаменить(Прав(СтрокИБ,СтрДлина(СтрокИБ) - СтрНайти(СтрокИБ,";Ref=")- 5) ,""";","");
		Путь = "E:\1c_base\Каспер_КэшКонфигурации\"+ИБ+"\";
	Иначе
		Путь = "\\192.168.117.247\обмен\Обработки\КЭШКонфигурации\";
	КонецЕсли;
	ПараметрыЗагрузки.Вставить("КаталогОбработки",Путь+КаталогТаблицы+"\");

КонецПроцедуры


//ТРЕБУЕТСЯ ДОРАБОТКА
Функция ПолучитьПравилаЗагрузкиКаспер(СтрокаТаблицы,ДополнительныеПараметры)

//ТекстЗапросаДолженФормироватьсяИзЗапросаИПравилЗагрузкиПараметровЗапроса
	ПравилаЗагрузкиКаспер = Новый Структура();
	Если  СтрокаТаблицы.ТипЗагрузкиКаспер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоПравиламОбмена Тогда
		Для каждого СтрокаЗапрос Из СтрокаТаблицы.Каспер_Запросы Цикл

			СтруктураЗапроса = Новый Структура("Имя,ТекстЗапроса,ПоДокументам,ПолеДокумента",СтрокаЗапрос.Имя,"",СтрокаЗапрос.ПоДокументам,"");
			
			Если СтрокаЗапрос.ПоДокументам = Истина Тогда
				СтруктураЗапроса.ПолеДокумента = "DOC_ID"; 
				Если ЗначениеЗаполнено(СтрокаТаблицы.Каспер_Запросы[0].ЗапросПоДокументам) Тогда
					СтруктураЗапроса.ПолеДокумента = СтрокаТаблицы.Каспер_Запросы[0].ЗапросПоДокументам;
				КонецЕсли;
			КонецЕсли;

			Если СтрокаЗапрос.ПоДокументам = Истина Тогда
				ТекстЗапроса = СтрокаЗапрос.ЗапросПоДокументам;
				Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
					ТекстЗапроса = СтрокаЗапрос.Запрос;
				КонецЕсли;
				
				ПолеДокумента = "DOC_ID"; 
				Если ЗначениеЗаполнено(СтрокаТаблицы.Каспер_Запросы[0].ЗапросПоДокументам) Тогда
					ПолеДокумента = СтрокаТаблицы.Каспер_Запросы[0].ЗапросПоДокументам;
				КонецЕсли;
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,":DOC_ID",":Документ");                                              
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%DOC_ID%",":Документ");                                              
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,":"+ПолеДокумента,":Документ");                                              
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%"+ПолеДокумента+"%",":Документ");                                              
			ИначеЕсли ИспользоватьДопУсловие Тогда
				ТекстЗапроса = СтрокаЗапрос.Запрос;
				Если ДополнительныеПараметры.Свойство("ЗагрузкаСписком") Тогда
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"= :Документ","in ("+ДополнительныеПараметры.ЗагрузкаСписком+")");
				Иначе
					Если ДополнительныеПараметры.Свойство("ЗагрузкаПоDOC_NUM") Тогда
						пДокумент = "(select MAX(DN.DOC_ID) FROM DOC DN WHERE  DN.DOC_NUM IN ('"+ИДКаспер+"'))";	
					Иначе
						пДокумент = ИДКаспер;	
					КонецЕсли;
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%Документ%",пДокумент);
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,":Документ",пДокумент);
				КонецЕсли;
				
			ИначеЕсли ЗагружатьИзмененияСДаты Тогда
				Если ЗначениеЗаполнено(НачалоПрошлойЗагрузки) Тогда
					ТекстЗапроса = СтрокаЗапрос.ЗапросСДатойИзменения;
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"'%ДатаИзменений%'",
					"to_date('"+НачалоДня(НачалоПрошлойЗагрузки)+"', 'DD.MM.YYYY"" ""HH24:MI:SS')");
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,":ДатаИзменений",
					"to_date('"+НачалоДня(НачалоПрошлойЗагрузки)+"', 'DD.MM.YYYY"" ""HH24:MI:SS')");
				ИначеЕсли ЗначениеЗаполнено(ДатаИзменений) Тогда
					ТекстЗапроса = СтрокаЗапрос.ЗапросСДатойИзменения;
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ДатаИзменений%",ДатаИзменений);
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса,":ДатаИзменений","'"+ДатаИзменений+"'");
				Иначе	
					ТекстЗапроса = СтрокаЗапрос.ЗапросПолный;
				КонецЕсли;
			Иначе
				ТекстЗапроса = СтрокаЗапрос.ЗапросПолный;
			КонецЕсли;
			СтруктураЗапроса.ТекстЗапроса = ТекстЗапроса;
		    ПравилаЗагрузкиКаспер.Вставить(СтруктураЗапроса.Имя,СтруктураЗапроса);
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ПравилаЗагрузкиКаспер;

КонецФункции

Функция ПолучитьПравилаЗагрузкиКлиент(СтрокаТаблицы, ТабличноеПолеВидыОбъектов, ДополнительныеПараметры, ПараметрыЗагрузки)
	
	Если  СтрокаТаблицы.ТипЗагрузкиКлиент = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ЗагрузкаПоПравиламОбмена Тогда
		ПравилаЗагрузкиКлиент_ПоКолонкам = ПолучитьПравилаЗагрузкиКлиент_ЗагрузкаПоПравиламОбмена_ПоКолонкам(СтрокаТаблицы, ТабличноеПолеВидыОбъектов);
		
		ПравилаЗагрузкиКлиент = Новый Структура();
		
		ИмяБлокаДанных = "Реквизиты";
		ТЧнаЗагрузку = Неопределено;
		Если ПравилаЗагрузкиКлиент_ПоКолонкам.Структура_Реквизиты_Каспер.Свойство(ИмяБлокаДанных,ТЧнаЗагрузку) = Истина Тогда
			ДополнитьПравилаЗагрузкиКлиент_ЗагрузкаПоПравиламОбмена(ПравилаЗагрузкиКлиент, ИмяБлокаДанных, ТЧнаЗагрузку, ДополнительныеПараметры, ПравилаЗагрузкиКлиент_ПоКолонкам, ПараметрыЗагрузки);
		КонецЕсли;
		
		ИмяБлокаДанных = "ТабличныеЧасти";
		ТЧнаЗагрузку = Неопределено;
		Если ПравилаЗагрузкиКлиент_ПоКолонкам.Структура_Реквизиты_Каспер.Свойство(ИмяБлокаДанных,ТЧнаЗагрузку) = Истина Тогда
			ДополнитьПравилаЗагрузкиКлиент_ЗагрузкаПоПравиламОбмена(ПравилаЗагрузкиКлиент, ИмяБлокаДанных, ТЧнаЗагрузку, ДополнительныеПараметры, ПравилаЗагрузкиКлиент_ПоКолонкам, ПараметрыЗагрузки);
		КонецЕсли;
		                                                     
		ИмяБлокаДанных = "Движения";
		ТЧнаЗагрузку = Неопределено;
		Если ПравилаЗагрузкиКлиент_ПоКолонкам.Структура_Реквизиты_Каспер.Свойство(ИмяБлокаДанных,ТЧнаЗагрузку) = Истина Тогда
			ДополнитьПравилаЗагрузкиКлиент_ЗагрузкаПоПравиламОбмена(ПравилаЗагрузкиКлиент, ИмяБлокаДанных, ТЧнаЗагрузку, ДополнительныеПараметры, ПравилаЗагрузкиКлиент_ПоКолонкам, ПараметрыЗагрузки);
		КонецЕсли;
		Возврат ПравилаЗагрузкиКлиент;
	КонецЕсли;
КонецФункции

Функция ПолучитьПравилаЗагрузкиКлиент_ЗагрузкаПоПравиламОбмена_ПоКолонкам(Знач СтрокаТаблицы, Знач ТабличноеПолеВидыОбъектов)
	
	Перем ДеревоРеквизитов, Колонка, МассивПолей, Структура_ЗначениеПоУмолчанию, Структура_ИзОбъекта, Структура_Реквизиты_1C, Структура_Реквизиты_Каспер, Суффикс_Узла;
	
	
	Суффикс_Узла = "_УЗЕЛ";
	ДеревоРеквизитов = СтрокаТаблицыВидаОбъектов_Получить(СтрокаТаблицы, ТабличноеПолеВидыОбъектов).ДеревоРеквизитов;
	МассивПолей = Новый Массив;
	Для каждого Колонка Из ДеревоРеквизитов.Колонки Цикл
		МассивПолей.Добавить(Колонка.Имя);
	КонецЦикла;
	
	Структура_Реквизиты_Каспер = ХМ_ЗагрузкаТЗ_Клиент.СоздатьСтруктуруИзСтрокДерева(ДеревоРеквизитов.Строки,"Имя","Каспер",МассивПолей,ЛОЖЬ,Суффикс_Узла,Истина);
	Структура_Реквизиты_1C = ХМ_ЗагрузкаТЗ_Клиент.СоздатьСтруктуруИзСтрокДерева(ДеревоРеквизитов.Строки,"Имя","С1",МассивПолей,ЛОЖЬ,Суффикс_Узла,Истина);
	Структура_ЗначениеПоУмолчанию = ХМ_ЗагрузкаТЗ_Клиент.СоздатьСтруктуруИзСтрокДерева(ДеревоРеквизитов.Строки,"Имя","ЗначениеПоУмолчанию",,ЛОЖЬ,,Истина);
	Структура_ИзОбъекта = ХМ_ЗагрузкаТЗ_Клиент.СоздатьСтруктуруИзСтрокДерева(ДеревоРеквизитов.Строки,"Имя","ИзОбъекта",,ЛОЖЬ,,Истина);

	ПравилаЗагрузкиКлиент = Новый Структура();
	ПравилаЗагрузкиКлиент.Вставить("Структура_Реквизиты_Каспер",Структура_Реквизиты_Каспер);
	ПравилаЗагрузкиКлиент.Вставить("Структура_Реквизиты_1C",Структура_Реквизиты_1C);
	ПравилаЗагрузкиКлиент.Вставить("Структура_ЗначениеПоУмолчанию",Структура_ЗначениеПоУмолчанию);
	ПравилаЗагрузкиКлиент.Вставить("Структура_ИзОбъекта",Структура_ИзОбъекта); 
	
    МаппингВидовОбъектов = ХМ_ЗагрузкаТЗ_Клиент.ПолучитьМаппингВидовОбъектов(ТабличноеПолеВидыОбъектов);
	Для каждого Группы_Каспер Из ПравилаЗагрузкиКлиент.Структура_Реквизиты_Каспер Цикл
		Если Прав(Группы_Каспер.Ключ,5) = "_УЗЕЛ" Тогда
			Продолжить;
		КонецЕсли;
		Для каждого СтрокаБлока ИЗ Группы_Каспер.Значение Цикл
			Если Прав(СтрокаБлока.Ключ,5) = "_УЗЕЛ" Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(СтрокаБлока.Значение) = Тип("Структура") Тогда
				Для каждого СтрокаРеквизита ИЗ СтрокаБлока.Значение Цикл
					СтруктураРеквизита = СтрокаРеквизита.Значение;
					СтруктураРеквизита.Вставить("СтрокаВидаОбъекта",ХМ_ЗагрузкаТЗ_Клиент.ПолучитьСтрокуМаппингаВидаОбъекта(МаппингВидовОбъектов,СтруктураРеквизита.Тип));
				КонецЦикла;                                               
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	                     
	Возврат ПравилаЗагрузкиКлиент;
                                             
КонецФункции

Функция СтрокаТаблицыВидаОбъектов_Получить(Знач СтруктураТаблицы, Знач ТабличноеПолеВидыОбъектов)
	
	СтруктураПоиска = Новый Структура("ТипОбъекта,ИмяТаблицы,ПредставлениеТаблицы",
	СтруктураТаблицы.ТипОбъекта,
	СтруктураТаблицы.ИмяТаблицы,
	СтруктураТаблицы.ПредставлениеТаблицы
	);

	СтрокиТаблицы = ТабличноеПолеВидыОбъектов.НайтиСтроки(СтруктураПоиска);
	Если СтрокиТаблицы.Количество() = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли СтрокиТаблицы.Количество() > 1 Тогда
		Возврат Неопределено;
	Иначе
		Возврат СтрокиТаблицы[0]; 
	КонецЕсли;

КонецФункции

Процедура ДополнитьПравилаЗагрузкиКлиент_ЗагрузкаПоПравиламОбмена(ПравилаЗагрузкиКлиент, ИмяБлокаДанных, ТЧнаЗагрузку, ДополнительныеПараметры, ПравилаЗагрузки, ПараметрыЗагрузки)
	
	Для каждого СтрокаНаЗагрузку Из ТЧнаЗагрузку Цикл
		
		МетаданныеЗначения_Имя = СтрокаНаЗагрузку.Ключ;
		
		Если  ТЧнаЗагрузку.Свойство(МетаданныеЗначения_Имя+"_УЗЕЛ") = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если Прав(МетаданныеЗначения_Имя,5) = "_УЗЕЛ" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяБлокаДанных = "Реквизиты" И (ДополнительныеПараметры.Свойство("ТолькоСверкаДанных") ИЛИ ПараметрыЗагрузки.Свойство("ТолькоСверкаДанных")) Тогда
			ДополнительныеПараметры.Вставить("Объект_Имя", ХМ_ЗагрузкаТЗ_Клиент.ПолучитьПоле1С(ТЧнаЗагрузку.Реквизиты_УЗЕЛ.Тип,""));
		ИначеЕсли (ДополнительныеПараметры.Свойство("ТолькоСверкаДанных") ИЛИ ПараметрыЗагрузки.Свойство("ТолькоСверкаДанных")) 
			И (НЕ ДополнительныеПараметры.Свойство("ЗагрузкаПоРезультатамСверки") ИЛИ НЕ ПараметрыЗагрузки.Свойство("ЗагрузкаПоРезультатамСверки")) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураЗагрузкиКлиент = Новый Структура();
		СтруктураЗагрузкиКлиент.Вставить("МетаданныеЗначения_Имя",МетаданныеЗначения_Имя);	
		СтруктураЗагрузкиКлиент.Вставить("Узел",ТЧнаЗагрузку[МетаданныеЗначения_Имя+"_УЗЕЛ"]);
		СтруктураЗагрузкиКлиент.Вставить("Каспер_МаппингРеквизитов",ТЧнаЗагрузку[МетаданныеЗначения_Имя]);
		СтруктураЗагрузкиКлиент.Вставить("С1_МаппингРеквизитов",ПравилаЗагрузки.Структура_Реквизиты_1C[ИмяБлокаДанных][МетаданныеЗначения_Имя]);
		СтруктураЗагрузкиКлиент.Вставить("Реквизиты_поУмолчанию",ПравилаЗагрузки.Структура_ЗначениеПоУмолчанию[ИмяБлокаДанных][МетаданныеЗначения_Имя]);
		СтруктураЗагрузкиКлиент.Вставить("Реквизиты_ИзОбъекта",ПравилаЗагрузки.Структура_ИзОбъекта[ИмяБлокаДанных][МетаданныеЗначения_Имя]);
		
		СуффиксБлокаДанных = ?(ИмяБлокаДанных = "Движение" И СтруктураЗагрузкиКлиент.Узел.С1 = Истина, "ПослеПровдения","");
		
		Если ПравилаЗагрузкиКлиент.Свойство(ИмяБлокаДанных+СуффиксБлокаДанных) = Ложь Тогда
        	ПравилаЗагрузкиКлиент.Вставить(ИмяБлокаДанных+СуффиксБлокаДанных, Новый Структура());	
		КонецЕсли;
		ПравилаЗагрузкиКлиент[ИмяБлокаДанных + СуффиксБлокаДанных].Вставить(МетаданныеЗначения_Имя,СтруктураЗагрузкиКлиент);

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьТекущееВремя()
	ТекущееВремя = Неопределено;
	Если НЕ ТипЗагрузкиКаспер = Перечисления.ХМ_ЗагрузкаКаспер_ТипЗагрузки.ПропуститьЗагрузку Тогда
		ХМ_Оракл = Обработки.ХМ_Оракл64.Создать();
		ТекущееВремя = ХМ_Оракл.ОРАКЛ_ЗагрузитьРезультатВТЗ("SELECT CURRENT_DATE FROM DUAL")[0].CURRENT_DATE;
		ХМ_Оракл = Неопределено;
	Иначе
		ТекущееВремя = ТекущаяДата(); 
	КонецЕсли;
    Возврат ТекущееВремя;
КонецФункции

#КонецОбласти
